# Repositories
tap "homebrew/bundle"

# Formulas
brew "awscli"
brew "bash"
brew "bat"
brew "curl"
brew "eza"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "htop"
brew "make"
brew "mas"
brew "mise"
brew "nano"
brew "speedtest-cli"
brew "switchaudio-osx"
brew "tree"
brew "uv"
brew "wget"
brew "xz"
brew "yt-dlp"
brew "zoxide"
brew "zsh"

# GUI APPs
cask "1password"
cask "1password-cli"
cask "brave-browser"
cask "bruno"
cask "codex"
cask "cryptomator"
cask "cursor"
cask "discord"
cask "docker"
cask "font-cascadia-code-pl"
cask "ghostty"
cask "google-chrome"
cask "jetbrains-toolbox"
cask "lm-studio"
cask "logi-options+"
cask "notion"
cask "prismlauncher"
cask "proton-drive"
cask "raycast"
cask "slack"
cask "spotify"
cask "steam"
cask "todoist"
cask "visual-studio-code"
cask "whatsapp"
cask "wireshark"

# Mac App Store APPs
mas "Prime Video", id: 545519333
mas "WireGuard", id: 1451685025
