akamud.vscode-theme-onedark
anysphere.cursorpyright
anysphere.remote-containers
anysphere.remote-ssh
astral-sh.ty
charliermarsh.ruff
christian-kohler.path-intellisense
eamodio.gitlens
esbenp.prettier-vscode
exiasr.hadolint
gruntfuggly.todo-tree
kevinrose.vsc-python-indent
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
njpwerner.autodocstring
pkief.material-icon-theme
pkief.material-product-icons
redhat.vscode-yaml
streetsidesoftware.code-spell-checker
tamasfe.even-better-toml
wayou.vscode-todo-highlight
